tap "hashicorp/tap"
tap "oven-sh/bun"
tap "saulpw/vd"
brew "act"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "cmake"
brew "fd"
brew "ffmpeg"
brew "openjdk"
brew "flyway"
brew "fzf"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "graphviz"
brew "htop"
brew "jq"
brew "just"
brew "libpq"
brew "maven"
brew "mingw-w64"
brew "neovim"
brew "node"
brew "nvm"
brew "openjdk@11"
brew "pipx"
brew "pkgconf"
brew "pnpm", link: false
brew "python@3.10"
brew "python@3.11"
brew "ripgrep"
brew "rustup"
brew "scc"
brew "stow"
brew "tmux"
brew "tree"
brew "websocat"
brew "wget"
brew "hashicorp/tap/terraform"
brew "oven-sh/bun/bun"
brew "saulpw/vd/visidata"
cask "google-cloud-sdk"
cask "linearmouse"
cask "maccy"
cask "orbstack"
cask "stats"
vscode "charliermarsh.ruff"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "jebbs.plantuml"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "prisma.prisma"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
